[
    {
        "id": "overview",
        "type": "title",
        "text": "Overview"
    },
    {
        "id": "overview",
        "type": "text",
        "text": "Config file contains a set of values that determine how file(s) are processed. Creating a config file is not necessary. Splix will apply a recommended configuration automatically, but sometimes this may cause problems, or you might want to tune the output."
    },
    {
        "id": "general",
        "type": "title",
        "text": "General"
    },
    {
        "id": "export-mode",
        "type": "cmd",
        "cmd": "export_mode:<0>"
    },
    {
        "id": "export-mode",
        "type": "text",
        "text": "<b>export_mode</b> determines if Splix should create a new output directory for encoded file(s). The default value is 0, which indicates that a new directory <b>aex_export_YY_MM_DD</b> will be created."
    },
    {
        "id": "export-dir",
        "type": "cmd",
        "cmd": "export_dir:</Users/user/Desktop/export>"
    },
    {
        "id": "export-dir",
        "type": "text",
        "cmd": "<b>export_dir</b> allows the user to set a custom output directory. If the directory does not exist, Splix will create a new directory in the specified path."
    },
    {
        "id": "backup-mode",
        "type": "cmd",
        "cmd": "backup_mode:<1>"
    },
    {
        "id": "backup-mode",
        "type": "text",
        "cmd": "<b>backup_mode</b> defines if original file(s) should be saved. Default value is 1, which indicates that a new directory <b>aex_backup_YY_MM_DD</b> will be created."
    },
    {
        "id": "backup-dir",
        "type": "cmd",
        "cmd": "backup_dir:</Users/user/Desktop/backup>"
    },
    {
        "id": "backup-dir",
        "type": "text",
        "cmd": "<b>backup_dir</b> will allow the user to set a custom backup directory. Invalid directory values will be ignored. If backup mode is set to false, this will be ignored as well."
    },
    {
        "id": "auto-match-top",
        "type": "cmd",
        "cmd": "auto_match_top:<1>"
    },
    {
        "id": "auto-match-top",
        "type": "text",
        "cmd": "<b>auto_match_top</b> determines if Splix should automatically detect overlapping lines. Overlapping lines will be set to the top of the screen. It is recommended to leave this setting to true."
    },
    {
        "id": "remove-long-line",
        "type": "cmd",
        "cmd": "remove_long_line:<0>"
    },
    {
        "id": "remove-long-line",
        "type": "text",
        "cmd": "<b>remove_long_line</b> will determine if lines containing too many characters should be removed. The default value is 0 which means that long lines are allowed."
    },
    {
        "id": "overwrite-mode",
        "type": "cmd",
        "cmd": "overwrite_mode:<auto>"
    },
    {
        "id": "overwrite-mode",
        "type": "text",
        "cmd": "<b>overwrite_mode</b> will define the mode used to determine if existing files should be overwritten. The values can set to: <b>auto</b>: prompt user to choose, <b>overwrite</b>: automatically overwrites existing files, <b>ignore</b>: does not overwrite files. If multiplexing mode is set to <b>fast</b> the overwriting mode auto is <b>not</b> viable, and will be set to ignore."
    },
    {
        "id": "removal-keyword",
        "type": "cmd",
        "cmd": "removal_keyword:<[Ss]plix>"
    },
    {
        "id": "removal-keyword",
        "type": "text",
        "cmd": "<b>removal_keyword</b> is an [regex](https://en.wikipedia.org/wiki/Regular_expression) string value, and will match lines containing the value. If this expression matches a line, then the line will be removed. In this example, matches would be splix and Splix."
    },
    {
        "id": "sync-buffer",
        "type": "cmd",
        "cmd": "sync_buffer:<1000>"
    },
    {
        "id": "sync-buffer",
        "type": "text",
        "cmd": "<b>sync_buffer</b> is an integer value, and determines the time in milliseconds to be added or subtracted from each line. In this example each line will gain 1 second to their timecode. Original: <b>00:01:02,700</b> output: <b>00:01:03,700</b>. Values can be positive or negative. If the value was <b>-1000</b> then output: <b>00:01:01,700</b>. Values 0, and aex_ignore will be ignored. The value can be preceeded with a timecode, which determines when syncing will start, e.g <b>00:15:45,-1000</b>."
    },
    {
        "id": "line-tuning",
        "type": "cmd",
        "cmd": "line_tuning:<ja_en>"
    },
    {
        "id": "line-tuning",
        "type": "text",
        "cmd": "<b>line_tuning</b> determines the quality check tuning language. In this example <b>ja</b> indicates original content language and <b>en</b> the subtitle language. Splix has tuning configurations for Japanese content: ja_ja and ja_en. Tuning should be set to <b>none</b> if content language is not Japanese."
    },
    {
        "id": "force-line-break",
        "type": "cmd",
        "cmd": "force_line_break:<1>"
    },
    {
        "id": "force-line-break",
        "type": "text",
        "cmd": "<b>force_line_break</b> determines if Splix should break long lines automatically. The line <b>The quick brown fox jumps over the lazy dog</b>, would be broken as follows: <b>The quick brown fox<break>jumps over the lazy dog</b>."
    }
]
