[
    {
        "id": "overview",
        "type": "title",
        "text": "Overview"
    },
    {
        "id": "overview",
        "type": "text",
        "text": "Config file contains a set of values that determine how file(s) are processed. Creating a config file is not necessary. Splix will apply a recommended configuration automatically, but sometimes this may cause problems, or you might want to tune the output."
    },
    {
        "id": "general",
        "type": "title",
        "text": "General"
    },
    {
        "id": "export-mode",
        "type": "cmd",
        "cmd": "export_mode:<0>"
    },
    {
        "id": "export-mode",
        "type": "text",
        "text": "<b>export_mode</b> determines if Splix should create a new output directory for encoded file(s). The default value is 0, which indicates that a new directory <b>aex_export_YY_MM_DD</b> will be created."
    },
    {
        "id": "export-dir",
        "type": "cmd",
        "cmd": "export_dir:</Users/user/Desktop/export>"
    },
    {
        "id": "export-dir",
        "type": "text",
        "text": "<b>export_dir</b> allows the user to set a custom output directory. If the directory does not exist, Splix will create a new directory in the specified path."
    },
    {
        "id": "backup-mode",
        "type": "cmd",
        "cmd": "backup_mode:<1>"
    },
    {
        "id": "backup-mode",
        "type": "text",
        "text": "<b>backup_mode</b> defines if original file(s) should be saved. Default value is 1, which indicates that a new directory <b>aex_backup_YY_MM_DD</b> will be created."
    },
    {
        "id": "backup-dir",
        "type": "cmd",
        "cmd": "backup_dir:</Users/user/Desktop/backup>"
    },
    {
        "id": "backup-dir",
        "type": "text",
        "text": "<b>backup_dir</b> will allow the user to set a custom backup directory. Invalid directory values will be ignored. If backup mode is set to false, this will be ignored as well."
    },
    {
        "id": "auto-match-top",
        "type": "cmd",
        "cmd": "auto_match_top:<1>"
    },
    {
        "id": "auto-match-top",
        "type": "text",
        "text": "<b>auto_match_top</b> determines if Splix should automatically detect overlapping lines. Overlapping lines will be set to the top of the screen. It is recommended to leave this setting to true."
    },
    {
        "id": "remove-long-line",
        "type": "cmd",
        "cmd": "remove_long_line:<0>"
    },
    {
        "id": "remove-long-line",
        "type": "text",
        "text": "<b>remove_long_line</b> will determine if lines containing too many characters should be removed. The default value is 0 which means that long lines are allowed."
    },
    {
        "id": "overwrite-mode",
        "type": "cmd",
        "cmd": "overwrite_mode:<auto>"
    },
    {
        "id": "overwrite-mode",
        "type": "text",
        "text": "<b>overwrite_mode</b> will define the mode used to determine if existing files should be overwritten. The values can set to: <b>auto</b>: prompt user to choose, <b>overwrite</b>: automatically overwrites existing files, <b>ignore</b>: does not overwrite files. If multiplexing mode is set to <b>fast</b> the overwriting mode auto is <b>not</b> viable, and will be set to ignore."
    },
    {
        "id": "removal-keyword",
        "type": "cmd",
        "cmd": "removal_keyword:<[Ss]plix>"
    },
    {
        "id": "removal-keyword",
        "type": "text",
        "text": "<b>removal_keyword</b> is an regex-string, and will match lines containing the value. If this expression matches a line, then the line will be removed. In this example, matches would be splix and Splix."
    },
    {
        "id": "sync-buffer",
        "type": "cmd",
        "cmd": "sync_buffer:<1000>"
    },
    {
        "id": "sync-buffer",
        "type": "text",
        "text": "<b>sync_buffer</b> is an integer value, and determines the time in milliseconds to be added or subtracted from each line. In this example each line will gain 1 second to their timecode. Original: <b>00:01:02,700</b> output: <b>00:01:03,700</b>. Values can be positive or negative. If the value was <b>-1000</b> then output: <b>00:01:01,700</b>. Values 0, and aex_ignore will be ignored. The value can be preceeded with a timecode, which determines when syncing will start, e.g <b>00:15:45,-1000</b>."
    },
    {
        "id": "line-tuning",
        "type": "cmd",
        "cmd": "line_tuning:<ja_en>"
    },
    {
        "id": "line-tuning",
        "type": "text",
        "text": "<b>line_tuning</b> determines the quality check tuning language. In this example <b>ja</b> indicates original content language and <b>en</b> the subtitle language. Splix has tuning configurations for Japanese content: <b>ja_ja</b> and <b>ja_en</b>. Tuning should be set to <b>none</b> if content language is not Japanese."
    },
    {
        "id": "force-line-break",
        "type": "cmd",
        "cmd": "force_line_break:<1>"
    },
    {
        "id": "force-line-break",
        "type": "text",
        "text": "<b>force_line_break</b> determines if Splix should break long lines automatically. The line <b>The quick brown fox jumps over the lazy dog</b>, would be broken as follows: <b>The quick brown fox<break>jumps over the lazy dog</b>."
    },
    {
        "id": "fps",
        "type": "cmd",
        "cmd": "frame_rate:<23.976>"
    },
    {
        "id": "fps",
        "type": "text",
        "text": "<b>frame_rate</b> sets the content frame-rate. It is used for encoding image-based subtitle files, such as <b>S_HDMV/PGS</b>. If the original file is a container, Splix will automatically detect the frame-rate."
    },
    {
        "id": "screen-width",
        "type": "cmd",
        "cmd": "screen_width:<1920>"
    },
    {
        "id": "screen-width",
        "type": "text",
        "text": "<b>screen_width</b> determines the content width. This value is used for encoding image-based subtitle files, such as <b>S_HDMV/PGS</b>. If the original file is a container, Splix can automatically detect this value."
    },
    {
        "id": "screen-height",
        "type": "cmd",
        "cmd": "screen_height:<1080>"
    },
    {
        "id": "screen-height",
        "type": "text",
        "text": "<b>screen_height</b> determines the content height. This value is used for encoding image-based subtitle files, such as <b>S_HDMV/PGS</b>. If the original file is a container, Splix can automatically detect this value."
    },
    {
        "id": "include-actors",
        "type": "cmd",
        "cmd": "include_actors:<0>"
    },
    {
        "id": "include-actors",
        "type": "text",
        "text": "<b>include_actors</b> determines if actors should be included in the exported file. Some formats like [Advanced SubStation Alpha](https://splix.org/#/docs/codecs) allow setting an actor for a line, but by default Splix will remove these."
    },
    {
        "id": "user-removal-key",
        "type": "cmd",
        "cmd": "user_removal_key:<^[Nn]ote:.*.{1}:>"
    },
    {
        "id": "user-removal-key",
        "type": "text",
        "text": "<b>user_removal_key</b> is an regex string. It determines a part of the line to be removed. In this example, if the line Begins with the word Note: or note: Splix will remove all text untill the first period."
    },
    {
        "id": "fix-upper-words",
        "type": "cmd",
        "cmd": "fix_upper_words:<0>"
    },
    {
        "id": "fix-upper-words",
        "type": "text",
        "text": "<b>fix_upper_words</b> determines if uppercase words should be fixed to regular casing. For example, a line: Hello, THERE! would be converted to Hello, there!."
    },
    {
        "id": "long-line-dur",
        "type": "cmd",
        "cmd": "long_line_dur:<10000>"
    },
    {
        "id": "long-line-dur",
        "type": "text",
        "text": "<b>long_line_dur</b> determines the maximum allowed line duration. If line exceeds this value, it will be removed. The default value is 10 seconds."
    },
    {
        "id": "container",
        "type": "title",
        "text": "Container"
    },
    {
        "id": "force-sub-lang",
        "type": "cmd",
        "cmd": "force_sub_lang:<1:ja,2:de>"
    },
    {
        "id": "force-sub-lang",
        "type": "text",
        "text": "<b>force_sub_lang</b> is an string value with delimiters. It defines the language for a specific subtitle track in a container. In this example track 2 will be set as Japanese, and track 3 will be set as German. Note, that track count starts at 0."
    },
    {
        "id": "force-audio-lang",
        "type": "cmd",
        "cmd": "force_audio_lang:<en>"
    },
    {
        "id": "force-audio-lang",
        "type": "text",
        "text": "<b>force_audio_lang</b> is an string value with delimiters. It defines the language for a specific audio track in a container. In this example no delimiters are provided which will set all audio tracks as English."
    },
    {
        "id": "embedded-subtitles",
        "type": "cmd",
        "cmd": "embedded_subtitles:<1>"
    },
    {
        "id": "embedded-subtitles",
        "type": "text",
        "text": "<b>embedded_subtitles</b> determines if image-based subtitles from a container should be included in the new encode or merge. Because image-based subtitles cannot be modified, you can remove them completely or include them. It is recommended to leave this as true."
    },
    {
        "id": "main-audio",
        "type": "cmd",
        "cmd": "main_audio_lang:<ja>"
    },
    {
        "id": "main-audio",
        "type": "text",
        "text": "<b>main_audio_lang</b> is a string value, and defines the container default audio flag. The flag indicates original content language for the video player."
    },
    {
        "id": "exact-track-name",
        "type": "cmd",
        "cmd": "exact_track_name:<Dialogue>"
    },
    {
        "id": "exact-track-name",
        "type": "text",
        "text": "<b>exact_track_name</b> is an regex string. To disable, use the value <b>aex_ignore</b>. It will only include subtitle tracks where the title caontains the provided value."
    },
    {
        "id": "custom-ignore",
        "type": "cmd",
        "cmd": "custom_track_ignore:<Commentary>"
    },
    {
        "id": "custom-ignore",
        "type": "text",
        "text": "<b>custom_track_ignore</b> is an regex string. To disable, use the value <b>aex_ignore</b>. This value indicates the track titles that should be ignored and not included in the final file."
    },
    {
        "id": "cut-time",
        "type": "cmd",
        "cmd": "cut_time:<00:00:10>"
    },
    {
        "id": "cut-time",
        "type": "text",
        "text": "<b>cut_time</b> contains the timecode for splitting a container file. In this example the file will be cut 10 seconds from the beginning."
    },
    {
        "id": "keep-chapters",
        "type": "cmd",
        "cmd": "keep_chapters:<0>"
    },
    {
        "id": "keep-chapters",
        "type": "text",
        "text": "<b>keep_chapters</b> determines if the chapters should be kept for the final encode. Some containers include chapters which indicate sections in the content, by default Splix will remove the chapters."
    },
    {
        "id": "exclude-tracks",
        "type": "cmd",
        "cmd": "exclude_tracks:<4,7>"
    },
    {
        "id": "exclude-tracks",
        "type": "text",
        "text": "<b>exclude_tracks</b> is an string value with delimiters. It will specify the track numbers to be ignored. In this example tracks 5 and 7 will be removed from the final encode. Note, that track count starts at 0."
    }
]
